API_TOKEN = "8016731179:AAGGe-S6u4j-J-jbBSiiVQNU6l7duwMK8mg"
API_TOKEN_DEV = "7784778971:AAEIiFsgp-6tkocJk2wdVXuFz3AV-uYvqe8"
DB_PATH = "sqlite:///bot.db"
ADMIN_PASSWORD = "1"
ADMIN_CHAT_ID = 884747686
API_KEY_WEATHER = '6df91d38540cdfbc7725ce091ed6bbac'
DATE = {
    'year': [2025, 2026, 2027, 2028, 2029, 2030],
    'month': ['январь', 'февраль', 'март', 'апрель', 'май', 'июнь', 'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь', 'декабрь'],
    "time": [
        "00:00",
        "00:30",
        "01:00",
        "01:30",
        "02:00",
        "02:30",
        "03:00",
        "03:30",
        "04:00",
        "04:30",
        "05:00",
        "05:30",
        "06:00",
        "06:30",
        "07:00",
        "07:30",
        "08:00",
        "08:30",
        "09:00",
        "09:30",
        "10:00",
        "10:30",
        "11:00",
        "11:30",
        "12:00",
        "12:30",
        "13:00",
        "13:30",
        "14:00",
        "14:30",
        "15:00",
        "15:30",
        "16:00",
        "16:30",
        "17:00",
        "17:30",
        "18:00",
        "18:30",
        "19:00",
        "19:30",
        "20:00",
        "20:30",
        "21:00",
        "21:30",
        "22:00",
        "22:30",
        "23:00"
  ],
    'minute': [minutes for minutes in range(0, 61)]
}

'''
Соц. Сети:
    Вк – 
    
Код:
    Гитхаб - 
    АдминВПС - 
    
Почты:
    
Игры:
    
Работа:
    мое дело
    псбанк
    
'''
